# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# Пример:

# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
# [2.0, 2.25, 2.37, 2.44, 2.49, 2.52]
# 14

n = int(input('Введите число: '))
result = 0

for i in range(1, n+1):
    result = result + (1+1/i)**i

print(round(result))